app/Controllers/Home.php

SELECT *
FROM `barang`
WHERE `barang`.`id` = 'W14'
---
    public function save()
    {
        $id = $this->request->getPost("id");
        $nama = $this->request->getPost("nama");
        $jumlah = $this->request->getPost("jumlah");
        $keterangan = $this->request->getPost("keterangan");
        $harga = $this->request->getPost("harga");
        $hargapcs = $this->request->getPost("harga_satuan");
        $jumlahpcs = $this->request->getPost("jumlah_satuan");

        if ($jumlah == "") {
            $jumlah = NULL;
        }
        if ($harga == "") {
            $harga = NULL;
        }
        if ($hargapcs == "") {
            $hargapcs = NULL;
        }
        if ($jumlahpcs == "") {
            $jumlahpcs = NULL;
        }

        $barang = new BarangModel();
        $dataBarang = $barang->find($id);

SELECT *
FROM `barang`
WHERE `barang`.`id` = 'W14'
---
    public function edit()
    {
        $id = $this->request->getPost("editId");
        $barang = new BarangModel();
        $dataBarang = $barang->find($id);