app/Models/BarangModel.php

SELECT *
FROM `barang`
---
    public function getData()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('barang');
        return $builder->get()->getResult();